import React from 'react'

const MESSAGE_0000 = [
  {
    name: '稻草人',
    text: [
      '.',
      '..',
      '...',
      '....',
      '.....',
      '......',
    ],
  }, {
    name: '哆拉樹',
    text: [
      '大家好!',
      '我被作者配置在樹下所以我叫做哆拉樹。',
      '作者說以前有玩過一些用 RPG 製作大師所製成的遊戲，但是從來沒有親自開發過。',
      '現在作者想做一份線上履歷來介紹自己，以 RPG 製作大師的風格來實作!',
      '因作者並不會美編，所以場景布置的不好看也請多多見諒。', <span > 還不知道如何操作的話請按 <kbd > ESC </kbd></span >,
      '如果你是行動裝置的話請觸碰左上角的選單按鈕。',
    ],
  }, {
    name: '古文碑',
    text: [<span > 作者本名叫 <mark > 盧宏寶 </mark> 在家排名老二，畢業於高雄市正修科技大學電機工程系，
    在網路世界中暱稱為 <mark>DKBO</mark > </span >,
      '英語聽、說很差讀，美感不好，正在努力中。',
    ],
  },
]
export default MESSAGE_0000
