export interface MapConfig {
  index: number
  name: string
  first: string
  second: string
  width: number
  height: number
  in: Array<{ x: number; y: number }>
}

export interface CollisionConfig {
  n?: string
  x: number
  y: number
  w: number
  h: number
  e?: number // Event index
  cm?: number // Change map to index
  cmm?: number // Change map spawn index
}

export interface MapData {
  map: MapConfig
  isMove: CollisionConfig[]
}

const ISMOVE_0000: MapData = {
  map: {
    index: 0,
    name: '大地圖',
    first: '/rpg/0000F.png',
    second: '/rpg/0000S.png',
    width: 1920,
    height: 1280,
    in: [
      { x: 472, y: 544 },
      { x: 1344, y: 512 },
      { x: 744, y: 40 },
      { x: 20, y: 1200 },
    ],
  },
  isMove: [
    { n: 'largetree', x: 896, y: 392, w: 64, h: 64 },
    { n: 'stone', x: 980, y: 512, w: 64, h: 1, e: 2 },
    { n: 'house', x: 384, y: 352, w: 224, h: 160 },
    { n: 'house', x: 384, y: 352, w: 224, h: 128 },
    { n: 'housedoor', x: 504, y: 480, w: 1, h: 32, cm: 1, cmm: 0 },
    { n: 'wood', x: 508, y: 524, w: 64, h: 18 },
    { n: 'fence', x: 409, y: 656, w: 309, h: 1 },
    { n: 'fence', x: 788, y: 656, w: 243, h: 1 },
    { n: 'fence', x: 409, y: 880, w: 621, h: 1 },
    { n: 'fence', x: 409, y: 656, w: 4, h: 224 },
    { n: 'fence', x: 1028, y: 656, w: 4, h: 224 },
    { n: 'bogy', x: 578, y: 760, w: 32, h: 1, e: 0 },
    { n: 'man', x: 810, y: 518, w: 32, h: 1, e: 1 },
    { n: '水池', x: 864, y: 768, w: 64, h: 1 },
    { n: '紅屋', x: 1312, y: 288, w: 448, h: 128 },
    { n: '紅屋', x: 1312, y: 448, w: 160, h: 32 },
    { n: '紅屋', x: 1316, y: 512, w: 24, h: 1 },
    { n: '紅屋', x: 1424, y: 512, w: 32, h: 1 },
    { n: '紅屋', x: 1536, y: 506, w: 64, h: 6 },
    { n: '紅屋', x: 1664, y: 506, w: 64, h: 6 },
    { n: '紅屋', x: 1344, y: 480, w: 12, h: 1, cm: 2, cmm: 0 },
    { n: '柵欄', x: 1230, y: 170, w: 610, h: 1 },
    { n: '柵欄', x: 1230, y: 608, w: 76, h: 1 },
    { n: '柵欄', x: 1408, y: 608, w: 434, h: 1 },
    { n: '柵欄', x: 1230, y: 170, w: 1, h: 416 },
    { n: '柵欄', x: 1840, y: 170, w: 1, h: 416 },
    { x: 1503, y: 1120, w: 66, h: 1 },
    { x: 1697, y: 1088, w: 63, h: 1 },
    { x: 1312, y: 1088, w: 65, h: 1 },
    { x: 960, y: 1088, w: 65, h: 1 },
    { x: 766, y: 1120, w: 67, h: 1 },
    { x: 1122, y: 1120, w: 62, h: 1 },
    { x: 416, y: 1120, w: 63, h: 1 },
    { x: 577, y: 1088, w: 63, h: 1 },
    { x: 1, y: 1088, w: 222, h: 0 },
    { x: 217, y: 300, w: 6, h: 726 },
    { x: 130, y: 1034, w: 60, h: 8 },
    { x: 98, y: 1024, w: 28, h: 1 },
    { x: 194, y: 1024, w: 28, h: 1 },
    { x: 88, y: 14, w: 8, h: 1013 },
    { x: 1, y: 1003, w: 87, h: 6 },
    { x: 314, y: 204, w: 387, h: 20 },
    { x: 800, y: 204, w: 63, h: 21 },
    { x: 94, y: 12, w: 577, h: 18 },
    { x: 862, y: 15, w: 1059, h: 17 },
    { x: 857, y: 32, w: 5, h: 180 },
    { x: 7, y: 1084, w: 216, h: 2 },
    { x: 223, y: 322, w: 96, h: 3 },
    { x: 310, y: 216, w: 9, h: 106 },
    { x: 799, y: 253, w: 0, h: 21 },
    { x: 797, y: 205, w: 2, h: 38 },
    { x: 702, y: 205, w: 4, h: 38 },
    { x: 680, y: 2, w: 173, h: 3 },
    { x: 5, y: 1126, w: 1, h: 152 },
  ],
}

const ISMOVE_0001: MapData = {
  map: {
    index: 1,
    name: '花草屋',
    first: '/rpg/0001F.png',
    second: '/rpg/0001S.png',
    width: 960,
    height: 640,
    in: [{ x: 472, y: 580 }],
  },
  isMove: [
    { n: 'man', x: 480, y: 352, w: 32, h: 0, e: 0 },
    { n: '牆', x: 448, y: 640, w: 64, h: 0, cm: 0, cmm: 0 },
    { n: '牆', x: 32, y: 0, w: 0, h: 640 },
    { n: '牆', x: 928, y: 0, w: 0, h: 640 },
    { n: '牆', x: 32, y: 32, w: 928, h: 0 },
    { n: '牆', x: 32, y: 608, w: 416, h: 0 },
    { n: '牆', x: 512, y: 608, w: 416, h: 0 },
    { n: '花', x: 128, y: 64, w: 32, h: 0 },
    { n: '花', x: 128, y: 224, w: 32, h: 0 },
    { n: '花', x: 128, y: 384, w: 32, h: 0 },
    { n: '花', x: 800, y: 64, w: 32, h: 0 },
    { n: '花', x: 800, y: 224, w: 32, h: 0 },
    { n: '花', x: 800, y: 384, w: 32, h: 0 },
    { n: '石碑', x: 224, y: 160, w: 32, h: 0 },
    { n: '石碑', x: 224, y: 320, w: 32, h: 0 },
    { n: '石碑', x: 704, y: 160, w: 32, h: 0 },
    { n: '石碑', x: 704, y: 320, w: 32, h: 0 },
  ],
}

const ISMOVE_0002: MapData = {
  map: {
    index: 2,
    name: '房屋(1F)',
    first: '/rpg/0002F.png',
    second: '/rpg/0002S.png',
    width: 1440,
    height: 960,
    in: [
      { x: 48, y: 896 },
      { x: 720, y: 96 },
    ],
  },
  isMove: [
    { n: '雕像', x: 33, y: 93, w: 32, h: 3 },
    { n: '雕像', x: 642, y: 94, w: 28, h: 3 },
    { n: '鋼琴', x: 309, y: 185, w: 55, h: 5 },
    { n: '桌子', x: 133, y: 320, w: 86, h: 22 },
    { n: '桌子', x: 454, y: 320, w: 84, h: 22 },
    { n: '牆壁', x: 32, y: 60, w: 640, h: 2 },
    { n: '牆壁', x: 128, y: 734, w: 2, h: 223 },
    { n: '牆壁', x: 131, y: 730, w: 1276, h: 4 },
    { n: '牆壁', x: 1406, y: 349, w: 3, h: 380 },
    { n: '牆壁', x: 1119, y: 352, w: 289, h: 32 },
    { n: '牆壁', x: 768, y: 352, w: 287, h: 32 },
    { n: '牆壁', x: 800, y: 58, w: 607, h: 6 },
    { n: '牆壁', x: 767, y: 0, w: 3, h: 351 },
    { n: '牆壁', x: 703, y: 5, w: 2, h: 379 },
    { n: '牆壁', x: 703, y: 383, w: 3, h: 195 },
    { n: '牆壁', x: 353, y: 544, w: 340, h: 32 },
    { n: '牆壁', x: 32, y: 544, w: 255, h: 32 },
    { n: '牆壁', x: 30, y: 62, w: 1, h: 895 },
    { n: '牆壁', x: 672, y: 61, w: 4, h: 451 },
    { n: '樓梯', x: 713, y: 6, w: 45, h: 7, cm: 3, cmm: 0 },
    { n: '人', x: 813, y: 510, w: 26, h: 4, e: 0 },
    { n: '牆壁', x: 795, y: 60, w: 6, h: 257 },
    { n: '牆壁', x: 1408, y: 60, w: 2, h: 261 },
    { n: '櫥櫃', x: 801, y: 93, w: 609, h: 2 },
    { n: '櫥櫃', x: 800, y: 192, w: 128, h: 1 },
    { n: '櫥櫃', x: 992, y: 192, w: 128, h: 1 },
    { n: '櫥櫃', x: 1184, y: 192, w: 128, h: 1 },
    { n: '櫥櫃', x: 800, y: 288, w: 128, h: 1 },
    { n: '櫥櫃', x: 992, y: 288, w: 128, h: 1 },
    { n: '櫥櫃', x: 1184, y: 288, w: 128, h: 1 },
    { n: '門口', x: 38, y: 952, w: 78, h: 7, cm: 0, cmm: 1 },
  ],
}

const ISMOVE_0003: MapData = {
  map: {
    index: 3,
    name: '房屋(2F)',
    first: '/rpg/0003F.png',
    second: '/rpg/0003S.png',
    width: 1440,
    height: 960,
    in: [{ x: 672, y: 160 }],
  },
  isMove: [
    { n: '牆壁', x: 1120, y: 352, w: 289, h: 32 },
    { n: '牆壁', x: 768, y: 352, w: 288, h: 32 },
    { n: '牆壁', x: 800, y: 64, w: 607, h: 1 },
    { n: '牆壁', x: 800, y: 64, w: 1, h: 257 },
    { n: '牆壁', x: 1408, y: 60, w: 2, h: 261 },
    { x: 0, y: 0, w: 0, h: 0 },
    { x: 0, y: 0, w: 0, h: 0 },
    { x: 33, y: 64, w: 447, h: 1 },
    { x: 32, y: 63, w: 1, h: 883 },
    { x: 32, y: 352, w: 449, h: 33 },
    { x: 800, y: 512, w: 256, h: 32 },
    { x: 1120, y: 512, w: 288, h: 33 },
    { x: 800, y: 541, w: 2, h: 162 },
    { x: 1406, y: 545, w: 2, h: 160 },
    { x: 0, y: 0, w: 0, h: 0 },
    { x: 125, y: 733, w: 3, h: 166 },
    { x: 32, y: 894, w: 94, h: 1 },
    { x: 768, y: 512, w: 3, h: 223 },
    { x: 125, y: 730, w: 1310, h: 5 },
    { x: 480, y: 384, w: 1, h: 256 },
    { x: 0, y: 0, w: 0, h: 0 },
    { x: 512, y: 64, w: 1, h: 192 },
    { x: 768, y: 64, w: 2, h: 227 },
    { x: 608, y: 288, w: 159, h: 32 },
    { x: 480, y: 64, w: 2, h: 192 },
    { x: 512, y: 350, w: 0, h: 290 },
    { x: 512, y: 352, w: 1, h: 288 },
    { x: 1406, y: 383, w: 3, h: 98 },
    { x: 576, y: 96, w: 32, h: 2, e: 0 },
    { x: 679, y: 221, w: 52, h: 1, cm: 2, cmm: 1 },
    { x: 513, y: 64, w: 257, h: 1 },
    { x: 481, y: 253, w: 32, h: 3 },
    { x: 481, y: 636, w: 32, h: 3 },
    { x: 664, y: 224, w: 80, h: 1 },
    { x: 0, y: 0, w: 0, h: 0 },
    { x: 665, y: 192, w: 1, h: 32 },
    { x: 741, y: 192, w: 1, h: 32 },
  ],
}

export const isMoveObject: MapData[] = [
  ISMOVE_0000,
  ISMOVE_0001,
  ISMOVE_0002,
  ISMOVE_0003,
]

export default isMoveObject
